[
  {
    "title": "Well-Site Operator Summer Student",
    "company": "Canadian Natural Resources Limited",
    "date": "May — Aug 2025",
    "location": "Bonnyville, AB",
    "description": "Sole on-shift operator responsible for approximately 50 conventional crude wells spread across 15 sites. Ran daily circuits to monitor production, record runtime data, and maintain natural gas-powered skid units including motors, generators, and hydraulic power units. Managed the full operational loop independently: preventative maintenance, production optimization, fluid level monitoring, and coordinating all third-party services from tank hauls to engine repairs. Identified underperforming wells through fluid shot diagnostics and adjusted pump speeds and rod lift parameters to restore output, bringing several wells back to target production. Worked a one-week-on, one-week-off rotation with full ownership of all sites during each shift.",
    "tags": ["Production Operations", "Preventative Maintenance", "Well Optimization", "Independent Field Work"]
  },
  {
    "title": "Expeditor Lead",
    "company": "Cactus Club Café",
    "date": "Jul 2024 — Jun 2025",
    "location": "Edmonton, AB",
    "description": "Hired as an expeditor and worked as one of two expo leads coordinating up to eight team members per shift at the pass. Responsible for sequencing and calling orders, conducting final quality checks on all outgoing plates, and managing the flow between kitchen and front of house during services of 400–500 covers on peak nights. Ensured all items within each bill were plated and delivered simultaneously at temperature, requiring constant coordination with multiple kitchen stations. Served as a primary trainer for new expeditors and collaborated with management to develop an updated training program for incoming team members. Also worked porter shifts as needed to support operations. Balanced the role part-time alongside full-time studies in Mechanical Engineering at the University of Alberta.",
    "tags": ["Team Coordination", "Quality Assurance", "Training & Development", "High-Volume Operations"]
  },
  {
    "title": "HVAC Sales Engineer Intern",
    "company": "Trane Technologies",
    "date": "May — Aug 2024",
    "location": "Edmonton, AB",
    "description": "Worked under a senior sales engineer supporting the full commercial HVAC sales pipeline — from initial equipment specification with design engineers through to contractor bidding and final quotes. Supported 5–6 concurrent projects ranging from small retrofits to large-scale developments including multi-use recreation centers, downtown towers, and warehouse builds. Collaborated with consulting engineers on equipment selection, running humidity calculations and helping specify AHU configurations to optimize system performance and operating costs. Assembled and negotiated quotes for contractors across the full product range including rooftop units, chillers, air handlers and VRF systems while working with vendors to build competitive package pricing. Learned the commercial strategy side of engineering sales: managing margins and competitive positioning against other manufacturers.  Progressed from background support to independently managing relationships with newer engineering clients and handling contractor-facing work by the end of the term.",
    "tags": ["HVAC", "Equipment Specification", "Client Management", "Technical Sales"]
  },
  {
    "title": "Floorhand",
    "company": "Ensign Energy Services",
    "date": "Jan — Aug 2023",
    "location": "Kindersley, SK",
    "description": "Floorhand on a super single drilling rig operating shallow horizontal crude wells for Teine Energy. Primary responsibilities centered on equipment maintenance and operational upkeep, including servicing generators, pumps, and auxiliary rig mechanical systems. Monitored fluid systems and assisted with routine inspections of BOP equipment and safety devices. Conducted daily hazard assessments and supported safe, continuous drilling operations. Maintained 100% HSE compliance through 12-hour shifts in remote field conditions.",
    "tags": ["Equipment Maintenance", "HSE Compliance", "Drilling Operations", "Safety Systems"]
  },
  {
    "title": "Floorhand",
    "company": "Precision Drilling",
    "date": "May — Dec 2022",
    "location": "Spirit River, AB",
    "description": "Worked as a floorhand on a triple drilling rig in remote northwestern Alberta, drilling 5–7 km horizontal sour gas wells for Tourmaline Oil. Operated on a walking rig that relocated between wellpads without disassembly. Responsible for all manual pipe handling operations on the drill floor, daily hazard assessments, and minor servicing of hydraulic, water, and steam systems. Participated in full rig moves including equipment teardown, transport coordination, and reassembly. Worked 20-day-on, 10-day-off rotations with 12-hour shifts.",
    "tags": ["Deep Well Drilling", "Rig Moves", "Pipe Handling", "Sour Gas Operations"]
  }
]
